<template>
  <section class="view-home">
    <base-title class="view-home__title">
      <template v-slot>Домашняя страница:</template>
    </base-title>
    <router-link class="view-home__link" :to="{ name: 'users' }">
      <svg
        class="view-home__link-icon"
        xmlns="http://www.w3.org/2000/svg"
        viewBox="0 0 512 512"
      >
        <path
          d="M437.02 74.98C388.667 26.629 324.38 0 256 0S123.333 26.629 74.98 74.98C26.629 123.333 0 187.62 0 256s26.629 132.667 74.98 181.02C123.333 485.371 187.62 512 256 512c46.813 0 92.617-12.758 132.462-36.893 9.447-5.724 12.467-18.022 6.744-27.469-5.724-9.449-18.023-12.467-27.469-6.744C334.144 461.244 295.505 472 256 472c-119.103 0-216-96.897-216-216S136.897 40 256 40s216 96.897 216 216c0 42.589-12.665 84.044-36.626 119.884-6.139 9.182-3.672 21.603 5.51 27.742 9.184 6.141 21.604 3.672 27.742-5.51C497.002 355.674 512 306.53 512 256c0-68.38-26.629-132.667-74.98-181.02z"
        />
        <path
          d="M234.665 151.423c-14.087-8.174-30.922-8.202-45.032-.074-14.163 8.155-22.618 22.798-22.618 39.169v130.965c0 16.371 8.455 31.014 22.618 39.169 7.034 4.052 14.742 6.076 22.452 6.076 7.757 0 15.516-2.052 22.58-6.151l112.847-65.482C361.593 286.924 370 272.309 370 256c0-16.309-8.407-30.924-22.488-39.095l-112.847-65.482zm92.771 109.074l-112.847 65.482c-2.063 1.199-3.855.665-4.994.01-1.178-.678-2.58-2.01-2.58-4.507V190.518c0-2.497 1.402-3.829 2.58-4.507.646-.372 1.501-.703 2.496-.703.761 0 1.604.194 2.498.713l112.847 65.482c2.12 1.229 2.564 3.124 2.564 4.497 0 1.373-.444 3.268-2.564 4.497z"
        />
      </svg>
    </router-link>
  </section>
</template>

<script>
import BaseTitle from "../components/Base/BaseTitle";
export default {
  name: "ViewHome",
  components: {
    BaseTitle,
  },
};
</script>

<style lang="scss">
.view-home {
  display: flex;
  flex-direction: column;

  height: 100%;

  &__title {
    margin-bottom: 0;
  }

  &__link {
    align-self: center;
    margin: auto 0;

    transition: 400ms ease;

    &:hover {
      transform: scale(1.1);
    }
  }

  &__link-icon {
    width: 80px;
    height: auto;
  }
}
</style>
